boke/models/Tool.php

SELECT `access_token` FROM `wx_token` WHERE gettime+expires_in>1492793619 ORDER BY `gettime` DESC
INSERT INTO `wx_token` (`access_token`, `gettime`, `expires_in`) VALUES ('hsGeSuYMZdW9k0xyFvOTxBwFC5gv40SoiLsTjiGpek4aQSpnKO4A3NrDJPkS4waz86pesew7qJ4WcsF43aCCVi3owWjYpZicC8J-A6KTbLYKvIWMJDsQnmQWQgennFqXLFYdAJATNG', '1492698244', '6900')
---
    public static function getAccessToken(){
        $token = '';
       $isExist = WxToken::find()->select('access_token')->where('gettime+expires_in>'.time())->orderBy('gettime desc')->one();
       if($isExist){
           $token =  $isExist->access_token;
       }else{
           $url='https://api.weixin.qq.com/cgi-bin/token';
           $params = [
               'grant_type'=>'client_credential',
               'appid'=>Yii::$app->params['appid'],
               'secret'=>Yii::$app->params['appsecret'],
           ];
           $curldata = self::httpCurl($url,$params);
           if(!empty($curldata)){
               $curldata = json_decode($curldata);
               $token = $curldata->access_token;
               $model = new WxToken();
               $model->access_token = $curldata->access_token;
               $model->gettime = strval(time());
               $model->expires_in =intval($curldata->expires_in-5*60);
               $res = $model->save();